W4D5/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "v@v.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "7qgnRPP_SuumsUT55J26cQ"], ["updated_at", "2019-01-31 22:12:56.666713"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!